
/******************************************************************************************************
 *
 *     TITLE       : Преобразование строки в JSON формат
 *     DATE TIME   : 25-04-2016 11:23
 *     USAGE       : t:=SJ(`[{"":"","":""},{"":"","":""},{"":"","":""}.....{"":"","":""}]`) = JSON
 *     DESCRIPTION : Analog => r.JSON()
 *     NOTE        : Всегда брать в [] - даже если одиночное значение = [{"":""}]
 *
 ******************************************************************************************************/
func SJ(m string) []Mst {
	var T, TE []Mst
	err := json.Unmarshal([]byte(m), &T)

	if err != nil {
	   return TE
	}
	return T
}
